<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"880e815860c3443e9f4f5a584f837cfa5f0f6ad592879011599c7b678134cf72","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1109 at https://github.com/cal-itp/data-infra/actions/runs/19868724533","plan_out_hash":"02a8ab6dcb4343700396651ca59192a23eda5f2afea2cef15b237bcd31aa9df9","plan_hash":"79a343bced583baa3afdfc9f7149b628d5b24c23f724b2967b9eb1f418e20cde","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 8 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/download_parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "SgfazQ==" -> (known after apply)
!~      detect_md5hash      = "E5DwBoeO3WOBKVartOgJMw==" -> "different hash"
!~      generation          = 1764122636984595 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_parse_and_validate_gtfs.py"
!~      md5hash             = "E5DwBoeO3WOBKVartOgJMw==" -> (known after apply)
        name                = "dags/download_parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/gtfs_validator/gtfs-validator-7.1.0-cli.jar"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "0hDaaA==" -> (known after apply)
!~      detect_md5hash      = "XbhzfsiRlTt9goCn2BPzKg==" -> "different hash"
!~      generation          = 1764122636988962 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "XbhzfsiRlTt9goCn2BPzKg==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/bigquery_to_download_config_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "q2W/ig==" -> (known after apply)
!~      detect_md5hash      = "pebUFZJxFAXmLZDbts7AvA==" -> "different hash"
!~      generation          = 1764122637438125 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/bigquery_to_download_config_operator.py"
!~      md5hash             = "pebUFZJxFAXmLZDbts7AvA==" -> (known after apply)
        name                = "plugins/operators/bigquery_to_download_config_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "gUkeBw==" -> (known after apply)
!~      detect_md5hash      = "29ltAjk4ZC7nudhaIAsmFA==" -> "different hash"
!~      generation          = 1764122637400621 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "29ltAjk4ZC7nudhaIAsmFA==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/unzip_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "u30a+g==" -> (known after apply)
!~      detect_md5hash      = "VRdUPDJwUQDirad658UFYw==" -> "different hash"
!~      generation          = 1764122636889715 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/unzip_gtfs_to_gcs_operator.py"
!~      md5hash             = "VRdUPDJwUQDirad658UFYw==" -> (known after apply)
        name                = "plugins/operators/unzip_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "/vB9ww==" -> (known after apply)
!~      detect_md5hash      = "xJoMFkOgFmaH9vQDF3rcAQ==" -> "different hash"
!~      generation          = 1764122636984480 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "xJoMFkOgFmaH9vQDF3rcAQ==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "2FXNxw==" -> (known after apply)
!~      detect_md5hash      = "bE9f/PjreIWPig75/NS6Vw==" -> "different hash"
!~      generation          = 1764122637987817 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "bE9f/PjreIWPig75/NS6Vw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "5pENHQ==" -> (known after apply)
!~      detect_md5hash      = "3KrGaUvOP8W/6eVlzvOsOw==" -> "different hash"
!~      generation          = 1764122639162554 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "3KrGaUvOP8W/6eVlzvOsOw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 8 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1109](https://github.com/cal-itp/data-infra/actions/runs/19868724533)